OpenFOAM file/OpenFOAM/cfdm-v2412/run/tutorials/multiphase/overInterDyMFoam/rigidBodyHull/background/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (overset rigidBodyDynamics);

application     overInterDyMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         4;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   0.25;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep  yes;

maxAlphaCo      15;

maxCo           70;

maxDeltaT       1;

functions
{
    minMax1
    {
        libs            (fieldFunctionObjects);
        type            fieldMinMax;
        fields          (U p);
    }
}


// ************************************************************************* //
